Repository: jurisdatum/lgu2-www-django
Catalog: lgu2/locale/*/LC_MESSAGES/django.po
Languages: cy

source: Welsh
cy: Cymraeg

source: Search Results
cy: Canlyniadau Chwilio

source: Your search for
cy: Mae eich chwiliad am

source: has returned
cy: wedi dod o hyd i

source: more than
cy: fwy na

source: results
cy: o ganlyniadau

source: Legislation by Type
cy: Deddfwriaeth yn ôl Math

source: Legislation by Year
cy: Deddfwriaeth fesul Blwyddyn

source: Title
cy: Teitl

source: Years and Numbers
cy: Blynyddoedd a Rhifau

source: Legislation type
cy: Math o ddeddfwriaeth

source: Back to top
cy: Yn ôl i’r brig

source: Previous
cy: Blaenorol

source: Next
cy: Nesaf

source: Partial dataset
cy: Set ddata rannol

source: Complete dataset
cy: Set ddata gyflawn

source: Present
cy: Presennol

source: The counts below reflect the number of documents on legislation.gov.uk that match the search for items of this legislation type and are not intended to indicate the total legislation made, enacted or adopted in a particular year.
cy: Mae’r cyfrifon isod yn adlewyrchu’r nifer o ddogfennau ar deddfwriaeth.gov.uk sy’n cyfateb i’r chwiliad am eitemau o’r math hwn o ddeddfwriaeth ac nid yw’n fwriad iddynt ddynodi cyfanswm y ddeddfwriaeth a wnaed, a weithredwyd nac a fabwysiadwyd mewn blwyddyn benodol.

source: About Us
cy: Amdanom ni

source: Site Map
cy: Map o’r safle

source: Accessibility
cy: Hygyrchedd

source: Contact Us
cy: Cysylltu â Ni

source: Privacy Notice
cy: Rhybudd Preifatrwydd

source: Cookies
cy: Cwcis

source: Crown and database right
cy: Hawl y goron a chronfa ddata

source: Home
cy: Hafan

source: Explore our Collections
cy: Archwilio ein Casgliadau

source: New Legislation
cy: Deddfwriaeth Newydd

source: Help and Guidance
cy: Cymorth ac Arweiniad

source: Changes to Legislation
cy: Newidiadau i Ddeddfwriaeth

source: Year
cy: Blwyddyn

source: Number
cy: Rhif

source: Type
cy: Math

source: All UK Legislation (excluding originating from the EU)
cy: Pob Deddfwriaeth y Deyrnas Unedig (ac eithrio yn deillio o’r UE)

source: All Legislation (including originating from the EU)
cy: Pob Legislation (gan gynnwys yn deillio o’r UE)

source: All Primary Legislation
cy: Pob deddfwriaeth sylfaenol

source: UK Public General Acts
cy: Deddfau Cyhoeddus Cyffredinol y Deyrnas Unedig

source: UK Local Acts
cy: Deddfau Lleol y Deyrnas Unedig

source: UK Private and Personal Acts
cy: Deddfau Preifat a Phersonol y DU

source: Acts of the Scottish Parliament
cy: Deddfau Senedd yr Alban

source: Acts of Senedd Cymru
cy: Deddfau Senedd Cymru

source: Acts of the National Assembly for Wales
cy: Deddfau Cynulliad Cenedlaethol Cymru

source: Measures of the National Assembly for Wales
cy: Mesurau Cynulliad Cenedlaethol Cymru

source: Church Measures
cy: Mesurau Eglwysig

source: Acts of the Northern Ireland Assembly
cy: Deddfau Cynulliad Gogledd Iwerddon

source: Acts of the Old Scottish Parliament
cy: Deddfau Hen Senedd yr Alban

source: Acts of the English Parliament
cy: Deddfau Senedd Lloegr

source: Acts of the Old Irish Parliament
cy: Deddfau Hen Senedd Iwerddon

source: Acts of the Parliament of Great Britain
cy: Deddfau Senedd Prydain Fawr

source: Local Acts of the Parliament of Great Britain
cy: Deddfau Lleol Senedd Prydain Fawr

source: Private and Personal Acts of the Parliament of Great Britain
cy: Deddfau Preifat a Phersonol Senedd Prydain Fawr

source: Northern Ireland Orders in Council
cy: Gorchmynion yn y Cyngor Gogledd Iwerddon

source: Measures of the Northern Ireland Assembly
cy: Mesurau Cynulliad Gogledd Iwerddon

source: Acts of the Northern Ireland Parliament
cy: Deddfau Senedd Gogledd Iwerddon

source: All Secondary Legislation
cy: Pob is-ddeddfwriaeth

source: UK Statutory Instruments
cy: Offerynnau Statudol y Deyrnas Unedig

source: Wales Statutory Instruments
cy: Offerynnau Statudol Cymru

source: Scottish Statutory Instruments
cy: Offerynnau Statudol yr Alban

source: Northern Ireland Statutory Rules
cy: Rheolau Statudol Gogledd Iwerddon

source: Church Instruments
cy: Offerynnau Eglwysig

source: UK Ministerial Directions
cy: Cyfarwyddiadau Gweinidogol y Deyrnas Unedig

source: UK Ministerial Orders
cy: Gorchmynion Gweinidogol y Deyrnas Unedig

source: UK Statutory Rules and Orders
cy: Rheolau a Gorchmynion Statudol y Deyrnas Unedig

source: Northern Ireland Statutory Rules and Orders
cy: Rheolau a Gorchmynion Statudol Gogledd Iwerddon

source: All Legislation originating from the EU
cy: Yr holl Ddeddfwriaeth sy’n deillio o’r UE

source: Regulations originating from the EU
cy: Rheoliadau yn deillio o’r UE

source: Decisions originating from the EU
cy: Penderfyniadau yn deillio o’r UE

source: Directives originating from the EU
cy: Cyfarwyddebau yn deillio o’r UE

source: European Union Treaties
cy: Cytuniadau’r Undeb Ewropeaidd

source: All Draft Legislation
cy: Pob Deddfwriaeth Ddrafft

source: UK Draft Statutory Instruments
cy: Offerynnau Statudol Drafft y Deyrnas Unedig

source: Scottish Draft Statutory Instruments
cy: Offerynnau Statudol Drafft yr Alban

source: Northern Ireland Draft Statutory Rules
cy: Rheolau Statudol Drafft Gogledd Iwerddon

source: All Impact Assessments
cy: Pob Asesiad Effaith

source: UK Impact Assessments
cy: Asesiadau Effaith y Deyrnas Unedig

source: Search
cy: Chwilio

source: Advanced Search
cy: Chwiliad Uwch

source: Table of Contents
cy: Tabl o’r Cynnwys

source: Content
cy: Cynnwys

source: Explanatory Notes
cy: Nodiadau Esboniadol

source: More Resources
cy: Rhagor o Adnoddau

source: Plain View
cy: Edrychiad Plaen

source: Print Options
cy: Dewisiadau Argraffu

source: What Version
cy: Pa Fersiwn

source: Latest available (Revised)
cy: Y Diweddaraf sydd Ar Gael (Diwygiedig)

source: Point in Time
cy: Pwynt Penodol mewn Amser

source: Original (As enacted)
cy: Gwreiddiol (Fel y'i Deddfwyd)

source: Advanced Features
cy: Nodweddion Uwch

source: Show Explanatory Notes for Sections
cy: Dangos Nodiadau Eglurhaol ar gyfer Adrannau

source: Opening Options
cy: Dewisiadau Agor

source: Open whole Act
cy: Agor y Ddeddf Gyfan

source: Open Act without Schedules
cy: Agor Deddf heb Atodlenni

source: Open Schedules only
cy: Agor Atodlenni yn unig

source: Original
cy: Gwreiddiol

source: King's Printer Version
cy: Fersiwn Argraffydd y Brenin

source: View more
cy: Gweld Mwy
