{
    "uk": {"p1": "Most of the Acts passed by UK Parliament are 'Public General Acts', which deal with matters of general public interest. UK Parliament also passes a small number of 'Private Acts', which are sub-divided into 'Local Acts' (relating to matters of local interest) and 'Personal Acts' (relating to particular persons - nowadays, these are very rare). Public and General Acts passed by the UK Parliament provide laws for the whole of the UK (England, Wales, Scotland and Northern Ireland). There are still many Acts in force that were enacted by the parliaments of the separate countries that co-existed in the British Isles before the United Kingdom of Great Britain and Ireland was formed in 1801.", "p2": "Legislation made by the current and historic Parliaments and Governments of the UK that applies to the whole of the UK.", "p3": "Legislation made by the Welsh Assembly or Welsh Parliament, Scottish Parliament, and Northern Ireland Assembly Parliament, that, although not made exclusively for the whole of the UK or by the UK Parliament and Government, may still apply in the UK."},

    "wales": {"p1": "The Welsh Parliament or Senedd Cymru is the democratically elected body that represents the interests of Wales and its people. The Welsh Parliament makes laws for Wales on specific subject areas. Outside these areas, different bodies (like local authorities or the UK government) make laws that apply to Wales. Before May 2020, the Senedd was officially known as the National Assembly for Wales (Cynulliad Cenedlaethol Cymru) and was often simply referred to as the Welsh Assembly.", "p2": "Legislation made by the Welsh Parliament or Welsh Assembly that applies exclusively to Wales, published in both English and Welsh languages.", "p3": "Legislation made by the UK Parliament and Government, and Historic Parliaments that, although not made exclusively for Wales or by the Welsh Parliament or Welsh Assembly, may still apply in Wales."},
    "scotland": {"p1": "The current Scottish Parliament was established in 1999 by the Scotland Act 1998 to debate issues and make laws for Scotland. The Scottish Parliament has power to make laws on a range of issues that are known as devolved matters, while some issues - known as reserved matters - remain the responsibility of the UK Parliament alone. Some Acts enacted by the Old Scottish Parliament from 1424 - 1707 are still in force.", "p2": "Legislation made by the Scottish Parliament that applies exclusively to Scotland.", "p3": "Legislation made by the UK Parliament and Government, and Historic Parliaments that, although not made exclusively for Scotland or by the Scottish Parliament, may still apply in Scotland."},
    "ni": {"p1": "The story of primary legislation for Northern Ireland has been complicated by the history of the political situation in the province since the foundation of an independent Irish state in the South and the consequent partition of the island in 1921. Read about the history of primary legislation for Northern Ireland below.", "p2": "Legislation made by the Northern Ireland Assembly and the Parliament of Northern Ireland that applies exclusively to Northern Ireland.", "p3": "Legislation made by the UK Parliament and Government, and Historic Parliaments that, although not made exclusively for Northern Ireland or by the Northern Ireland Assembly, may still apply in Northern Ireland."}
}